"use client"
const EmojiContext = ()=>{
    const emoji = [
        '😌', '😍', '🥰', '😘', '😗', '😙', '😚', '😋', '😛', '😝', '😜', '🤪', '🤨', '🧐', '🤓', '😎', '🥸', '🤩', '🥳', '😏', '😒', '😞', '😔', '😟', '😕', '🙁', '☹️', '😣', '😖', '😫', '😩', '🥺', '😢', '😭', '😤', '😠', '😡', '🤬', '🤯', '😳', '🥵', '🥶', '😱', '😨', '😰', '😥', '😓', '🤗', '🤔', '🤭', '🤫', '🤥', '😶', '😐', '😑', '😬', '🙄', '😯', '😦', '😧', '😮', '😲', '🥱', '😴', '🤤', '😪', '😵', '🤐', '🥴', '🤢', '🤮', '🤧', '😷', '🤒', '🤕', '🤑', '👿', '👹', '👺', '💀', '👻', '👽', '👾', '🤖', '💩', '😺', '😸', '😹', '😻', '😼', '😽', '🙀', '😿', '😾',
       ];

       function handleSymbolClick(symbolItem) {
        navigator.clipboard.writeText(symbolItem);
     }
    return(
        <>
         <h1>Emoji for Threads App You Can Copy And Paste 😍</h1>
         <div className="flex">
            {
               emoji.map((symbolItem) => (<span key={symbolItem} className='symbol-size' onClick={() => handleSymbolClick(symbolItem)}>
                  {symbolItem}
               </span>))
            }
         </div>
        
        </>
    )
} 

export default EmojiContext;